#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02f71590ffce04a6d]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d0823136d4d8684e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a8b0e61d019598eb]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0c7d69b1ce54dc090]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0324123674ab08122]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-095cd7d8e71f09e96]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08368933c60282243]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04da9a7dd058adaee]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0c9c6a3cb3c951e27]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06c4b56d1b75b8310]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d938e60a6926f078]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e6c543dce1d6187b]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0c13bb439a572a66f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c9a0c400434730db]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04c387144d0f7b1c3]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-032eb0155a9ce2926]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01c562065c1cc6a0b]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02465a4c8d4e36add]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a6bf894d64ad2b4d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b3da422e7d6e4e70]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-07023e90d40778bd9]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d938e60a6926f0781080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-08368933c60282243"
      ~ tags                   = {
          ~ "Name"        = "vpc-us-east-1-prod-default" -> "vpc-us-east-1-prd-default"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all               = {
          ~ "Name"        = "vpc-us-east-1-prod-default" -> "vpc-us-east-1-prd-default"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0c7d69b1ce54dc090"
      ~ tags                   = {
          ~ "Name"        = "vpc-us-east-1-prod-default" -> "vpc-us-east-1-prd-default"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all               = {
          ~ "Name"        = "vpc-us-east-1-prod-default" -> "vpc-us-east-1-prd-default"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-0d0823136d4d8684e"
        name                   = "default"
      ~ tags                   = {
          ~ "Name"        = "vpc-us-east-1-prod-default" -> "vpc-us-east-1-prd-default"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all               = {
          ~ "Name"        = "vpc-us-east-1-prod-default" -> "vpc-us-east-1-prd-default"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-04c387144d0f7b1c3"
      ~ tags     = {
          ~ "Name"        = "vpc-us-east-1-prod" -> "vpc-us-east-1-prd"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all = {
          ~ "Name"        = "vpc-us-east-1-prod" -> "vpc-us-east-1-prd"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-06c4b56d1b75b8310"
      ~ tags             = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1a" -> "vpc-us-east-1-prd-private-us-east-1a"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1a" -> "vpc-us-east-1-prd-private-us-east-1a"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-04da9a7dd058adaee"
      ~ tags             = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1b" -> "vpc-us-east-1-prd-private-us-east-1b"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1b" -> "vpc-us-east-1-prd-private-us-east-1b"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c9c6a3cb3c951e27"
      ~ tags             = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1c" -> "vpc-us-east-1-prd-private-us-east-1c"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1c" -> "vpc-us-east-1-prd-private-us-east-1c"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0d938e60a6926f078"
      ~ tags             = {
          ~ "Name"        = "vpc-us-east-1-prod-public" -> "vpc-us-east-1-prd-public"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "vpc-us-east-1-prod-public" -> "vpc-us-east-1-prd-public"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0a6bf894d64ad2b4d" -> (known after apply)
      ~ subnet_id      = "subnet-0c9a0c400434730db" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0b3da422e7d6e4e70" -> (known after apply)
      ~ subnet_id      = "subnet-0e6c543dce1d6187b" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[2] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-07023e90d40778bd9" -> (known after apply)
      ~ subnet_id      = "subnet-0c13bb439a572a66f" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-032eb0155a9ce2926" -> (known after apply)
      ~ subnet_id      = "subnet-095cd7d8e71f09e96" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-01c562065c1cc6a0b" -> (known after apply)
      ~ subnet_id      = "subnet-0a8b0e61d019598eb" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[2] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-02465a4c8d4e36add" -> (known after apply)
      ~ subnet_id      = "subnet-0324123674ab08122" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-0c9a0c400434730db" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.0.0/24" -> "10.0.0.0/22" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0c9a0c400434730db" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1a" -> "vpc-us-east-1-prd-private-us-east-1a"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1a" -> "vpc-us-east-1-prd-private-us-east-1a"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-0e6c543dce1d6187b" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.1.0/24" -> "10.0.4.0/22" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0e6c543dce1d6187b" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1b" -> "vpc-us-east-1-prd-private-us-east-1b"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1b" -> "vpc-us-east-1-prd-private-us-east-1b"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-0c13bb439a572a66f" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.0.2.0/24" -> "10.0.8.0/22" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0c13bb439a572a66f" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1c" -> "vpc-us-east-1-prd-private-us-east-1c"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "vpc-us-east-1-prod-private-us-east-1c" -> "vpc-us-east-1-prd-private-us-east-1c"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-095cd7d8e71f09e96" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.3.0/24" -> "10.0.12.0/22" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-095cd7d8e71f09e96" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ map_public_ip_on_launch                        = false -> true
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"        = "vpc-us-east-1-prod-public-us-east-1a" -> "vpc-us-east-1-prd-public-us-east-1a"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "vpc-us-east-1-prod-public-us-east-1a" -> "vpc-us-east-1-prd-public-us-east-1a"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-0a8b0e61d019598eb" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.4.0/24" -> "10.0.16.0/22" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0a8b0e61d019598eb" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ map_public_ip_on_launch                        = false -> true
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"        = "vpc-us-east-1-prod-public-us-east-1b" -> "vpc-us-east-1-prd-public-us-east-1b"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "vpc-us-east-1-prod-public-us-east-1b" -> "vpc-us-east-1-prd-public-us-east-1b"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-0324123674ab08122" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.0.5.0/24" -> "10.0.20.0/22" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0324123674ab08122" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ map_public_ip_on_launch                        = false -> true
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"        = "vpc-us-east-1-prod-public-us-east-1c" -> "vpc-us-east-1-prd-public-us-east-1c"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "vpc-us-east-1-prod-public-us-east-1c" -> "vpc-us-east-1-prd-public-us-east-1c"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-02f71590ffce04a6d"
      ~ tags                                 = {
          ~ "Name"        = "vpc-us-east-1-prod" -> "vpc-us-east-1-prd"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      ~ tags_all                             = {
          ~ "Name"        = "vpc-us-east-1-prod" -> "vpc-us-east-1-prd"
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 12 to add, 9 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*